Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: To ease the use of various types of files, the argparse module provides the factory FileType which takes the ``mode=`` and ``bufsize=`` arguments of the ``file`` object. For example, ``FileType('w')`` can be used to create a writable file::
pl: Aby ułatwić użycie różnych typów plików, moduł argparse dostarcza fabrykę FileType która pobiera parametry ``mode=`` i ``bufsize=`` przedmiotu ``file``. Dla przykładu ``FileType('w')`` może być użyte do utworzenia zapisywalnego pliku::

source: ``type=`` can take any callable that takes a single string argument and returns the type-converted value::
pl: ``type=`` może brać dowolną wywoływalną która pobiera pojedynczy parametr ciągu znaków i zwraca zamienioną według typu wartość::

source: >>> def perfect_square(string): ... value = int(string) ... sqrt = math.sqrt(value) ... if sqrt != int(sqrt): ... msg = "%r is not a perfect square" % string ... raise argparse.ArgumentTypeError(msg) ... return value ... >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('foo', type=perfect_square) >>> parser.parse_args('9'.split()) Namespace(foo=9) >>> parser.parse_args('7'.split()) usage: PROG [-h] foo PROG: error: argument foo: '7' is not a perfect square
pl: >>> def perfect_square(string): ... value = int(string) ... sqrt = math.sqrt(value) ... if sqrt != int(sqrt): ... msg = "%r nie jest idealnym kwadratem" % string ... raise argparse.ArgumentTypeError(msg) ... return value ... >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('foo', type=perfect_square) >>> parser.parse_args('9'.split()) Namespace(foo=9) >>> parser.parse_args('7'.split()) użycie: PROG [-h] foo PROG: error: parametr foo: '7' nie jest idealnym kwadratem

source: The choices_ keyword argument may be more convenient for type checkers that simply check against a range of values::
pl: Parametr słowa kluczowego choices_ może być bardziej przydatny dla sprawdzenia typu które po prostu sprawdzają z zakresem wartości::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('foo', type=int, choices=xrange(5, 10)) >>> parser.parse_args('7'.split()) Namespace(foo=7) >>> parser.parse_args('11'.split()) usage: PROG [-h] {5,6,7,8,9} PROG: error: argument foo: invalid choice: 11 (choose from 5, 6, 7, 8, 9)
pl: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('foo', type=int, choices=xrange(5, 10)) >>> parser.parse_args('7'.split()) Namespace(foo=7) >>> parser.parse_args('11'.split()) użycie: PRG [-h] {5,6,7,8,9} PROG: błąd: parametr foo: niewłaściwy wybór: 11 (wybierz z 5, 6, 7, 8, 9)

source: See the choices_ section for more details.
pl: Zobacz rozdział choices_ po więcej szczegółów.

source: choices
pl: choices (- z ang. - wybory)

source: Some command-line args should be selected from a restricted set of values. These can be handled by passing a container object as the ``choices`` keyword argument to :meth:`add_argument`. When the command-line is parsed, arg values will be checked, and an error message will be displayed if the arg was not one of the acceptable values::
pl: Niektóre parametry wiersza-poleceń powinny być wybierane z ograniczonego zbioru wartości. Takie parametry mogą być obsłużone przez przekazanie przedmiotu kontenera jako parametr ``choices`` dla sposobu postępowania :meth:`add_argument`. Gdy wiersz poleceń jest wczytywany, wartości parametrów zostaną sprawdzone, i wiadomość o błędzie będzie wyświetlona, jeśli parametr nie był jedną z akceptowalnych wartości::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('foo', choices='abc') >>> parser.parse_args('c'.split()) Namespace(foo='c') >>> parser.parse_args('X'.split()) usage: PROG [-h] {a,b,c} PROG: error: argument foo: invalid choice: 'X' (choose from 'a', 'b', 'c')
pl: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('foo', choices='abc') >>> parser.parse_args('c'.split()) Namespace(foo='c') >>> parser.parse_args('X'.split()) użycie: PROG [-h] {a,b,c} PROG: błąd: parametr foo: niewłaściwy wybór: 'X' (wybierz z 'a', 'b', 'c')

source: Note that inclusion in the ``choices`` container is checked after any type_ conversions have been performed, so the type of the objects in the ``choices`` container should match the type_ specified::
pl: Zauważ że zawarcie w pojemniku ``choices`` jest sprawdzane po tym jak wszelkie konwersje typu - type_ - zostały wykonane, tak że typ przedmiotów w pojemniku ``choices`` powinien odpowiadać określonemu typowi - type_::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('foo', type=complex, choices=[1, 1j]) >>> parser.parse_args('1j'.split()) Namespace(foo=1j) >>> parser.parse_args('-- -4'.split()) usage: PROG [-h] {1,1j} PROG: error: argument foo: invalid choice: (-4+0j) (choose from 1, 1j)
pl: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('foo', type=complex, choices=[1, 1j]) >>> parser.parse_args('1j'.split()) Namespace(foo=1j) >>> parser.parse_args('-- -4'.split()) usage: PROG [-h] {1,1j} PROG: błąd: parametr foo: niewłaściwy wybór: (-4+0j) (wybierz z 1, 1j)

source: Any object that supports the ``in`` operator can be passed as the ``choices`` value, so :class:`dict` objects, :class:`set` objects, custom containers, etc. are all supported.
pl: Dowolne przedmioty które wspierają operator ``in`` mogą być przekazywane jako wartość ``choices``, tak że przedmioty słownika - :class:`dict`, przedmioty zbiorów - :class:`set` szczególne pojemniki, itd. są wszystkie wspierane.

source: required
pl: wymagane

source: In general, the argparse module assumes that flags like ``-f`` and ``--bar`` indicate *optional* arguments, which can always be omitted at the command-line. To make an option *required*, ``True`` can be specified for the ``required=`` keyword argument to :meth:`add_argument`::
pl: Ogólnie, moduł argparse zakłada że flagi takie, jak ``-f`` i ``--bar`` wskazują parametry *opcjonalne*, które zawsze mogą być pominięte w wierszu polecenia. Aby uczynić opcję *wymaganą*, ``True`` może być określne dla parametru słowa kluczowego ``required=`` dla sposobu postępowania :meth:`add_argument`::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', required=True) >>> parser.parse_args(['--foo', 'BAR']) Namespace(foo='BAR') >>> parser.parse_args([]) usage: argparse.py [-h] [--foo FOO] argparse.py: error: option --foo is required
pl: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', required=True) >>> parser.parse_args(['--foo', 'BAR']) Namespace(foo='BAR') >>> parser.parse_args([]) użycie: argparse.py [-h] [--foo FOO] argparse.py: błąd: opcja --foo jest wymagana

source: As the example shows, if an option is marked as ``required``, :meth:`parse_args` will report an error if that option is not present at the command line.
pl: Jak pokazuje powyższy przykład, jeśli opcja jest oznaczona jako ``wymagana`` ( - z ang. - ``required``), sposób postępowania :meth:`parse_args` zgłosi błąd jeśli ta opcja nie będzie obecna w wierszu polecenia.

source: Required options are generally considered bad form because users expect *options* to be *optional*, and thus they should be avoided when possible.
pl: Opcje wymagane są zwykle uważane za niewłaściwą formę ponieważ użytkownicy oczekują *opcji* aby były *opcjonalne*, więc ich konieczność powinna być możliwe do uniknięcia gdy tylko jest to możliwe.

source: help
pl: pomoc

source: The ``help`` value is a string containing a brief description of the argument. When a user requests help (usually by using ``-h`` or ``--help`` at the command-line), these ``help`` descriptions will be displayed with each argument::
pl: wartość ``help`` jest ciągiem znaków zawierającym krótki opis parametrów. Gdy użytkownik zażąda pomocy (zwykle przez użycie ``-h`` lub ``--help`` w wierszu polecenia), te opisy ``pomocy`` będą wyświetlone z każdym parametrem::

source: >>> parser = argparse.ArgumentParser(prog='frobble') >>> parser.add_argument('--foo', action='store_true', ... help='foo the bars before frobbling') >>> parser.add_argument('bar', nargs='+', ... help='one of the bars to be frobbled') >>> parser.parse_args('-h'.split()) usage: frobble [-h] [--foo] bar [bar ...] positional arguments: bar one of the bars to be frobbled optional arguments: -h, --help show this help message and exit --foo foo the bars before frobbling
pl: >>> parser = argparse.ArgumentParser(prog='frobble') >>> parser.add_argument('--foo', action='store_true', ... help='zfufaj bary przed frobblaniem') >>> parser.add_argument('bar', nargs='+', ... help='jeden z barów do zfrobblania') >>> parser.parse_args('-h'.split()) użycie: frobble [-h] [--foo] bar [bar ...] pozycyjne parametry: bar jeden z barów do zfrobblania opcjonalne parametry: -h, --help pokaż tą wiadomość pomocy i wyjdź --foo zfufaj bary przed frobblaniem

source: The ``help`` strings can include various format specifiers to avoid repetition of things like the program name or the argument default_. The available specifiers include the program name, ``%(prog)s`` and most keyword arguments to :meth:`add_argument`, e.g. ``%(default)s``, ``%(type)s``, etc.::
pl: Ciągi znaków ``pomocy`` mogą zawierać różne określenia formatu aby uniknąć powtórzeń rzeczy takich jak nazwa programu lub parametru domyślnego - z ang. - default_. Dostępne określenia zawierają nazwę programu, ``%(prog)s`` i większość parametrów słów kluczowych dla sposobu postępowania :meth:`add_argument`, np. ``%(default)s``, ``%(type)s``, itp.::

source: >>> parser = argparse.ArgumentParser(prog='frobble') >>> parser.add_argument('bar', nargs='?', type=int, default=42, ... help='the bar to %(prog)s (default: %(default)s)') >>> parser.print_help() usage: frobble [-h] [bar] positional arguments: bar the bar to frobble (default: 42) optional arguments: -h, --help show this help message and exit
pl: >>> parser = argparse.ArgumentParser(prog='frobble') >>> parser.add_argument('bar', nargs='?', type=int, default=42, ... help='bar dla %(prog)s (domyślnie: %(default)s)') >>> parser.print_help() użycie: frobble [-h] [bar] pozycyjne parametry: bar bar dla frobble (domyślnie: 42) opcjonalne parametry: -h, --help pokaż tą wiadomość pomocy i wyjdź

source: When :class:`ArgumentParser` generates help messages, it need some way to refer to each expected argument. By default, ArgumentParser objects use the dest_ value as the "name" of each object. By default, for positional argument actions, the dest_ value is used directly, and for optional argument actions, the dest_ value is uppercased. So, a single positional argument with ``dest='bar'`` will that argument will be referred to as ``bar``. A single optional argument ``--foo`` that should be followed by a single command-line arg will be referred to as ``FOO``. An example::
pl: Gdy uogólnienie :class:`ArgumentParser` generuje wiadomości pomocy, potrzebuje pewnego sposobu aby odnieść się do każdego oczekiwanego parametru. Domyślnie, przedmioty ArgumentParser używają wartości dest_ jako "nazwy" każdego przedmiotu. Domyślnie, dla pozycyjnych akcji parametrów wartość dest_ jest używana bezpośrednio, a dla akcji opcjonalnych parametrów, wartość dest_ jest pisana z dużej litery. Więc, pojedynczy pozycyjny parametr z ``dest='bar'```będzie określony jako ``bar``. Pojedynczy opcjonalny parametr ``--foo`` po którym powinien wystąpić pojedynczy parametr wiersza-poleceń będzie określany jako ``FOO``. Na przykład::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo') >>> parser.add_argument('bar') >>> parser.parse_args('X --foo Y'.split()) Namespace(bar='X', foo='Y') >>> parser.print_help() usage: [-h] [--foo FOO] bar positional arguments: bar optional arguments: -h, --help show this help message and exit --foo FOO
pl: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo') >>> parser.add_argument('bar') >>> parser.parse_args('X --foo Y'.split()) Namespace(bar='X', foo='Y') >>> parser.print_help() użycie: [-h] [--foo FOO] bar pozycyjne parametry: bar opcjonalne parametry: -h, --help pokaż tą wiadomość pomocy i wyjdź --foo FOO

source: An alternative name can be specified with ``metavar``::
pl: Alternatywna nazwa może być określona za pomocą ``metavar``::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', metavar='YYY') >>> parser.add_argument('bar', metavar='XXX') >>> parser.parse_args('X --foo Y'.split()) Namespace(bar='X', foo='Y') >>> parser.print_help() usage: [-h] [--foo YYY] XXX positional arguments: XXX optional arguments: -h, --help show this help message and exit --foo YYY
pl: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--foo', metavar='YYY') >>> parser.add_argument('bar', metavar='XXX') >>> parser.parse_args('X --foo Y'.split()) Namespace(bar='X', foo='Y') parser.print_help() użycie: [-h] [--foo YYY] XXX pozycyjne parametry: XXX opcjonalne parametry: -h, --help pokaż tą wiadomość pomocy i wyjdź --foo YYY

source: Note that ``metavar`` only changes the *displayed* name - the name of the attribute on the :meth:`parse_args` object is still determined by the dest_ value.
pl: Zauważ, że ``metavar`` tylko zmienia *wyświetlaną* nazwę - nazwa parametru przedmiotu :meth:`parse_args` jest wciąż określana przez wartość dest_.

source: Different values of ``nargs`` may cause the metavar to be used multiple times. Providing a tuple to ``metavar`` specifies a different display for each of the arguments::
pl: Różne wartości ``nargs`` mogą spowodować że metavar będzie użyte kilkakrotnie. Dostarczając krotkę do ``metavar`` określa inną wyświetlaną nazwę dla każdego parametru::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-x', nargs=2) >>> parser.add_argument('--foo', nargs=2, metavar=('bar', 'baz')) >>> parser.print_help() usage: PROG [-h] [-x X X] [--foo bar baz] optional arguments: -h, --help show this help message and exit -x X X --foo bar baz
pl: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-x', nargs=2) >>> parser.add_argument('--foo', nargs=2, metavar=('bar', 'baz')) >>> parser.print_help() użycie: PROG [-h] [-x X X] [--foo bar baz] opcjonalne parametry: -h, -help pokaż tą wiadomość pomocy i wyjdź -x X X --foo bar baz

source: Most :class:`ArgumentParser` actions add some value as an attribute of the object returned by :meth:`parse_args`. The name of this attribute is determined by the ``dest`` keyword argument of :meth:`add_argument`. For positional argument actions, ``dest`` is normally supplied as the first argument to :meth:`add_argument`::
pl: Większość działań uogólnienia :class:`ArgumentParser` dodaj pewną wartość jako właściwość przedmiotu zwracaną przez :meth:`parse_args`. Nazwa tej właściwości jest określana przez parametr słowa kluczowego ``dest`` dla sposobu postępowania :meth:`add_argument`. Dla działań parametrów pozycyjnych, ``dest`` jest zwykle dostarczana jako pierwszy parametr dla sposobu postępowania :meth:`add_argument`::

source: For optional argument actions, the value of ``dest`` is normally inferred from the option strings. :class:`ArgumentParser` generates the value of ``dest`` by taking the first long option string and stripping away the initial ``'--'`` string. If no long option strings were supplied, ``dest`` will be derived from the first short option string by stripping the initial ``'-'`` character. Any internal ``'-'`` characters will be converted to ``'_'`` characters to make sure the string is a valid attribute name. The examples below illustrate this behavior::
pl: Dla opcjonalnych działań parametrów, wartość ``dest`` jest zwykle wnioskowana z ciągów znaków opcji. Uogólnienie :class:`ArgumentParser` generuje wartość ``dest`` przez wzięcie pierwszego długiego ciągu znaków opcji i odcięciu początkowego ciągu znaków ``'--'``. Jeśli żadna długa opcja nie została dostarczona, ``dest`` będzie pochodną pierwszego krótkiego ciągu opcji przez obcięcie początkowego znaku ``'-'``. Dowolne wewnętrzne znaki ``'-'`` będą zamienione na ``'_'`` aby zapewnić że ciąg znaków jest poprawną nazwą właściwości. Przykłady poniżej ilustrują to zachowanie::

source: ``dest`` allows a custom attribute name to be provided::
pl: ``dest`` pozwala szczególnym nazwom właściwości aby były dostarczane::

source: The parse_args() method
pl: sposób postępowania parse_args()

source: Convert argument strings to objects and assign them as attributes of the namespace. Return the populated namespace.
pl: Zamień ciągi znaków parametrów na przedmioty i przypisz je jako właściwości przestrzeni nazw. Zwróć zapełnioną przestrzeń nazw.

source: Previous calls to :meth:`add_argument` determine exactly what objects are created and how they are assigned. See the documentation for :meth:`add_argument` for details.
pl: Poprzednie wywołania :meth:`add_argument` określają dokładnie, które przedmioty są tworzone i jak są one przypisywane. Zobacz dokumentację dla sposobu postępowania :meth:`add_argument` dla szczegółów.

source: By default, the arg strings are taken from :data:`sys.argv`, and a new empty :class:`Namespace` object is created for the attributes.
pl: Domyślnie ciągi znaków arg są brane z :data:`sys.argv`, i nowa pusta przestrzeń nazw :class:`Namespace` jest tworzona dla właściwości.

source: Option value syntax
pl: składnia wartości opcji

source: The :meth:`parse_args` method supports several ways of specifying the value of an option (if it takes one). In the simplest case, the option and its value are passed as two separate arguments::
pl: Sposób postępowania :meth:`parse_args` wspiera kilka sposobów określania wartości opcji (jeśli pobiera ona jedną). W najprostszym przypadku, opcja i jej wartość są przekazywane jako dwa oddzielne parametry::

source: For long options (options with names longer than a single character), the option and value can also be passed as a single command line argument, using ``=`` to separate them::
pl: Dla opcji długich (opcji z nazwami dłuższymi niż pojedynczy znak), opcja i wartość mogą także być przekazane jako pojedynczy parametr wiersza polecenia, używając ``=`` aby je rozdzielić::

source: For short options (options only one character long), the option and its value can be concatenated::
pl: Dla opcji krótkich (opcji o długości tylko pojedynczego znaku), opcja i jej wartość mogą być połączone::

source: Several short options can be joined together, using only a single ``-`` prefix, as long as only the last option (or none of them) requires a value::
pl: kilka krótkich opcji może być połączone razem, używając tylko pojedynczego znaku przedrostka ``-``, tak długo jak tylko ostatnia opcja (lub żadna z nich) wymaga wartości::

source: Invalid arguments
pl: Nieważne parametry

source: While parsing the command-line, ``parse_args`` checks for a variety of errors, including ambiguous options, invalid types, invalid options, wrong number of positional arguments, etc. When it encounters such an error, it exits and prints the error along with a usage message::
pl: Podczas wczytywania wiersza polecenia, ``parse_args`` sprawdza różne błędy, zawierające wieloznaczne opcje, nieważne typy, nieważne opcje, niewłaściwe liczby parametrów pozycyjnych, itp. Gdy napotka ona taki błąd, wychodzi ona i wypisuje błąd razem z wiadomością użycia::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('--foo', type=int) >>> parser.add_argument('bar', nargs='?') >>> # invalid type >>> parser.parse_args(['--foo', 'spam']) usage: PROG [-h] [--foo FOO] [bar] PROG: error: argument --foo: invalid int value: 'spam' >>> # invalid option >>> parser.parse_args(['--bar']) usage: PROG [-h] [--foo FOO] [bar] PROG: error: no such option: --bar >>> # wrong number of arguments >>> parser.parse_args(['spam', 'badger']) usage: PROG [-h] [--foo FOO] [bar] PROG: error: extra arguments found: badger
pl: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('--foo', type=int) parser.add_argument('bar', nargs='?') >>> # niewłaściwy typ >>> parser.parse_args('[--foo', 'spam']) użycie: PROG [-h] [--foo FOO] [bar] PROG: error: argument --foo: niewłaściwa wartość całkowita: 'spam' >>> # niewłaściwa opcja >>> parser.parse_args(['--bar']) użycie: PROG [-h] [--foo FOO] [bar] PROG: błąd: brak takiej opcji: --bar >>> # nieprawidłowa liczba argumentów >>> parser.parse_args(['spam', 'borsuk']) użycie: PROG [-h] [--foo FOO] [bar] PROG: błąd: nadmiarowe parametry napotkane: borsuk

source: Arguments containing ``"-"``
pl: Parametry zawierające ``"-"``

source: The ``parse_args`` method attempts to give errors whenever the user has clearly made a mistake, but some situations are inherently ambiguous. For example, the command-line arg ``'-1'`` could either be an attempt to specify an option or an attempt to provide a positional argument. The ``parse_args`` method is cautious here: positional arguments may only begin with ``'-'`` if they look like negative numbers and there are no options in the parser that look like negative numbers::
pl: Sposób postępowania ``parse_args`` próbuje dawać błędy za każdym razem gdy użytkownik w jasny sposób się pomylił, ale niektóre sytuacje są samoistnie wieloznaczne. Dla przykładu, parametr wiersza-poleceń ``'-1'`` może być albo próbą określenia opcji lub próbą dostarczenia parametru pozycyjnego. Sposób postępowania ``parse_args`` jest ostrożny tutaj: pozycyjne parametry mogą zaczynać się tylko od ``'-'`` jeśli wyglądają jak liczby ujemne i nie ma opcji w czytniku która wyglądałaby jak liczba ujemna::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-x') >>> parser.add_argument('foo', nargs='?') >>> # no negative number options, so -1 is a positional argument >>> parser.parse_args(['-x', '-1']) Namespace(foo=None, x='-1') >>> # no negative number options, so -1 and -5 are positional arguments >>> parser.parse_args(['-x', '-1', '-5']) Namespace(foo='-5', x='-1') >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-1', dest='one') >>> parser.add_argument('foo', nargs='?') >>> # negative number options present, so -1 is an option >>> parser.parse_args(['-1', 'X']) Namespace(foo=None, one='X') >>> # negative number options present, so -2 is an option >>> parser.parse_args(['-2']) usage: PROG [-h] [-1 ONE] [foo] PROG: error: no such option: -2 >>> # negative number options present, so both -1s are options >>> parser.parse_args(['-1', '-1']) usage: PROG [-h] [-1 ONE] [foo] PROG: error: argument -1: expected one argument
pl: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-x') >>> parser.add_argument('foo', nargs='?') >>> # brak opcji liczb ujemnych, więc -1 jest pozycyjnym parametrem >>> parser.parse_args(['-x', '-1'] Namespace(foo=None, x='-1') >>> # brak opcji liczb ujemnych, więc -1 i -5 są parametrami pozycyjnymi >>> parser.parse_args(['-x', '-1', '-5']) Namespace(foo='-5', x='-1') >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-1', dest='one') >>> parser.add_argument('foo', nargs='?') >>> # opcje ujemnych liczb obecne, więc -1 jest opcją >>> parser.parse_args(['-1', 'X']) Namespace(foo=None, one='X') >>> # obecne opcje liczb ujemnych wiec -2 jest opcją >>> parser.parse_args['-2']) użycie: PROG [-h] [-1 ONE] [foo] PROG: błąd: brak takiej opcji: -2 >>> # opcje liczb ujemnych obecne, więc oba zapisy -1 są opcjami >>> parser. parse_args(['-1', '-1']) użycie: PROG [-h] [-1 ONE] [foo] PROG: błąd: parametr -1: oczekiwano pojedynczego parametru
